## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/184034)



<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_event_rule.shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_9837A402
  * aws_cloudwatch_event_target.shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SharesApi-Event-SNS-Target_BC87420C
  * aws_cloudwatch_metric_alarm.shares-api-events_sharesapievents-rule-dlq-alarm_89927093
  * aws_sns_topic.shares-api-events_shares-api-event-topic_E9F56597
  * aws_sns_topic_policy.shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF
  * aws_sqs_queue.shares-api-events_sns-topic-dql_E0EEF171
  * null_resource.shares-api-events_null-resource_1316E48E



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.shares-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_5B92A5DA will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "shares-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_5B92A5DA" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_9837A402 will be created
  + resource "aws_cloudwatch_event_rule" "shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_9837A402" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "pocket_share_created",
                  + "pocket_share_context_updated",
                ]
              + source      = [
                  + "shares-api-events",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-SharesApiEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_target.shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SharesApi-Event-SNS-Target_BC87420C will be created
  + resource "aws_cloudwatch_event_target" "shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SharesApi-Event-SNS-Target_BC87420C" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Prod-SharesApiEvents-Rule-Rule"
      + target_id      = "PocketEventBridge-Prod-SharesApi-Event-SNS-Target"

      + dead_letter_config {
          + arn = (known after apply)
        }
    }

  # aws_cloudwatch_metric_alarm.shares-api-events_sharesapievents-rule-dlq-alarm_89927093 will be created
  + resource "aws_cloudwatch_metric_alarm" "shares-api-events_sharesapievents-rule-dlq-alarm_89927093" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + alarm_description                     = "Number of messages >= 10"
      + alarm_name                            = "PocketEventBridge-Prod-SharesApiEvents-Rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Prod-SNS-SharesApiEvents-Topic-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 4
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "PocketEventBridge"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.shares-api-events_shares-api-event-topic_E9F56597 will be created
  + resource "aws_sns_topic" "shares-api-events_shares-api-event-topic_E9F56597" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "PocketEventBridge-Prod-SharesApiEventTopic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "PocketEventBridge"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF will be created
  + resource "aws_sns_topic_policy" "shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.shares-api-events_sns-topic-dql_E0EEF171 will be created
  + resource "aws_sqs_queue" "shares-api-events_sns-topic-dql_E0EEF171" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-SharesApiEvents-Topic-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "PocketEventBridge"
        }
      + tags_all                          = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # null_resource.shares-api-events_null-resource_1316E48E will be created
  + resource "null_resource" "shares-api-events_null-resource_1316E48E" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"20f89bea-49f1-4ae1-a60e-aa0616f75f65","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":544,"Program":"tfcmt","SHA1":"d9476dcb32dce29d682582abd9bbfbb90e5bcb08","Target":"pocket-event-bridge-cdk","Vars":{}} -->